Documents/РегистрацияПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрацияПрочихВыплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВРеглУчете</Name>
					<Comment>Отражение счета выплаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиИсполнителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияВРеглУчете</Name>
							<Comment>Отнесение затрат</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияРегистрацийВНалоговомОрганеВторичный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВНалоговомОрганеВторичный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СпособыОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВБухУчете</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РегистрацияПрочихВыплат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ПрочиеВыплаты.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Функция ПодготовитьПараметрыПроведения(Объект, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;

	ДанныеПрочихВыплат = ДанныеПрочихВыплат(Объект);
	
	ПараметрыПроведения.Вставить("ДанныеПрочихВыплат", ДанныеПрочихВыплат);
	
	Если НЕ ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетПрочихВыплатУП");
		Модуль.ПодготовитьПараметрыПроведенияРегистрацияПрочихВыплат(ПараметрыПроведения, Объект, Отказ);
	КонецЕсли;
	
	Возврат ПараметрыПроведения;

КонецФункции

Функция РеквизитыОтветственныхЛиц() Экспорт
	
	РеквизитыОтветственныхЛиц = Новый Массив;
	
	РеквизитыОтветственныхЛиц.Добавить("Исполнитель");
	РеквизитыОтветственныхЛиц.Добавить("ДолжностьИсполнителя");
	
	Возврат РеквизитыОтветственныхЛиц
	
КонецФункции	

#КонецОбласти

#Область ЗагрузкаДанныхИзФайла

// Устанавливает параметры загрузки.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - Адрес временного хранилища с таблицей значений, в которой
//                                        находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - Порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - Адрес временного хранилища с пустой таблицей значений,
//                                        являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - Список неоднозначных значений, для которых в ИБ имеется несколько
//                                              подходящих вариантов.
//     * Колонка       - Строка - Имя колонки, в которой была обнаружена неоднозначность;
//     * Идентификатор - Число  - Идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - Полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ДанныеСопоставление	= ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные	= ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	МассивФИО	               = ЗагружаемыеДанные.ВыгрузитьКолонку("ФизЛицо_ФИО");
	МассивПериодВзаиморасчетов = ЗагружаемыеДанные.ВыгрузитьКолонку("ПериодВзаиморасчетов");  
	МассивСпособОтраженияВРеглУчете = ЗагружаемыеДанные.ВыгрузитьКолонку("СпособОтраженияВРеглУчете");  
	
	НовыйМассивПериодВзаиморасчетов = Новый Массив;
	
	Для Каждого ЭлементПериодВзаиморасчетов Из МассивПериодВзаиморасчетов Цикл
		Попытка
			НовыйЭлементПериодВзаиморасчетов = Дата(Прав(ЭлементПериодВзаиморасчетов, 4) + Сред(ЭлементПериодВзаиморасчетов, 4, 2) + Лев(ЭлементПериодВзаиморасчетов, 2));		
			НовыйМассивПериодВзаиморасчетов.Добавить(НовыйЭлементПериодВзаиморасчетов);	
		Исключение	
			НовыйМассивПериодВзаиморасчетов.Добавить(ЭлементПериодВзаиморасчетов);
		КонецПопытки;
	КонецЦикла;
			
	ЗагружаемыеДанные.Колонки.Удалить("ФизЛицо_ФИО");  
	ЗагружаемыеДанные.Колонки.Удалить("СпособОтраженияВРеглУчете");
	ЗагружаемыеДанные.Колонки.Удалить("ПериодВзаиморасчетов");
	   
	ЗагружаемыеДанные.Колонки.Добавить("ФизЛицо_ФИО",          Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)));
	ЗагружаемыеДанные.Колонки.Добавить("СпособОтраженияВРеглУчете", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	ЗагружаемыеДанные.Колонки.Добавить("ПериодВзаиморасчетов", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		
	ЗагружаемыеДанные.ЗагрузитьКолонку(МассивФИО, 	                    "ФизЛицо_ФИО");
	ЗагружаемыеДанные.ЗагрузитьКолонку(НовыйМассивПериодВзаиморасчетов, "ПериодВзаиморасчетов");
	ЗагружаемыеДанные.ЗагрузитьКолонку(МассивСпособОтраженияВРеглУчете, "СпособОтраженияВРеглУчете");
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗагружаемыеДанные.ФизЛицо_ФИО КАК ФизЛицоФИО,
	|	ЗагружаемыеДанные.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЗагружаемыеДанные.СуммаНачисления КАК СуммаНачисления,
	|	ЗагружаемыеДанные.СпособОтраженияВРеглУчете КАК СпособОтраженияВРеглУчете,
	|	ЗагружаемыеДанные.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ЗагружаемыеДанные
	|ИЗ
	|	&ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизЛица.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(ФизЛица.ФизЛицо) КАК ФизЛицо,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФизЛица.ФизЛицо) КАК КоличествоФизЛиц
	|ПОМЕСТИТЬ ВТДанныеФизЛица
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗагружаемыеДанные.Идентификатор КАК Идентификатор,
	|		ФизЛица.Ссылка КАК ФизЛицо
	|	ИЗ
	|		ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛица
	|			ПО (ФизЛица.Наименование = ЗагружаемыеДанные.ФизЛицоФИО)
	|	ГДЕ
	|		ЗагружаемыеДанные.ФизЛицоФИО <> """") КАК ФизЛица
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизЛица.Идентификатор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛица.Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    |
	|ВЫБРАТЬ
	|	СпособыОтраженияЗарплатыВБухУчете.Идентификатор,
	|	МАКСИМУМ(СпособыОтраженияЗарплатыВБухУчете.СпособОтраженияВРеглУчете) КАК СпособОтраженияВРеглУчете,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпособыОтраженияЗарплатыВБухУчете.СпособОтраженияВРеглУчете) КАК КоличествоСпособовОтражения
	|ПОМЕСТИТЬ ВТДанныеСпособыОтраженияЗарплатыВБухУчете
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗагружаемыеДанные.Идентификатор КАК Идентификатор,
	|		СпособыОтраженияЗарплатыВБухУчете.Ссылка КАК СпособОтраженияВРеглУчете
	|	ИЗ
	|		ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособыОтраженияЗарплатыВБухУчете
	|			ПО (СпособыОтраженияЗарплатыВБухУчете.Наименование = ЗагружаемыеДанные.СпособОтраженияВРеглУчете)
	|	ГДЕ
	|		ЗагружаемыеДанные.СпособОтраженияВРеглУчете <> """") КАК СпособыОтраженияЗарплатыВБухУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	СпособыОтраженияЗарплатыВБухУчете.Идентификатор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособыОтраженияЗарплатыВБухУчете.Идентификатор
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗагружаемыеДанные.Идентификатор КАК Идентификатор,
	|	ЗагружаемыеДанные.ФизЛицоФИО КАК ФизЛицоФИО,
	|	ЗагружаемыеДанные.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЗагружаемыеДанные.СуммаНачисления КАК СуммаНачисления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФизЛица.КоличествоФизЛиц, 0) = 1
	|			ТОГДА ФизЛица.ФизЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособыОтражения.КоличествоСпособовОтражения, 0) = 1
	|			ТОГДА СпособыОтражения.СпособОтраженияВРеглУчете
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|	КОНЕЦ КАК СпособОтраженияВРеглУчете,
	|	ЕСТЬNULL(ФизЛица.КоличествоФизЛиц, 0) КАК КоличествоФизЛиц, 
	|	ЕСТЬNULL(СпособыОтражения.КоличествоСпособовОтражения, 0) КАК КоличествоСпособовОтражения 
	|ИЗ
	|	ЗагружаемыеДанные КАК ЗагружаемыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеФизЛица КАК ФизЛица
	|		ПО (ФизЛица.Идентификатор = ЗагружаемыеДанные.Идентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСпособыОтраженияЗарплатыВБухУчете КАК СпособыОтражения
	|		ПО (СпособыОтражения.Идентификатор = ЗагружаемыеДанные.Идентификатор)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЗагружаемыеДанные", ЗагружаемыеДанные); 
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДанныеСопоставление.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.КоличествоФизЛиц > 1 Тогда
			ЗаписьОНеоднозначности					= СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор	= Выборка.Идентификатор;
			ЗаписьОНеоднозначности.Колонка			= "ФизическоеЛицо";
		КонецЕсли;
		Если Выборка.КоличествоСпособовОтражения > 1 Тогда
			ЗаписьОНеоднозначности					= СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор	= Выборка.Идентификатор;
			ЗаписьОНеоднозначности.Колонка			= "СпособОтраженияВРеглУчете";
		КонецЕсли;
			
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеСопоставление, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//  ИмяКолонки                - Строка - Имя колонки, в который возникла неоднозначность.
//  СписокНеоднозначностей    - Массив - Массив для заполнения с неоднозначными данными.
//  ЗагружаемыеЗначенияСтрока - Строка - Загружаемые данные на основании которых возникла неоднозначность.
//  ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ИмяКолонки = "ФизЛицо" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СпрФизЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК СпрФизЛица
		|";
		
		ТекстУсловия = "ГДЕ ИСТИНА";
		
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.ФизЛицо_ФИО) Тогда
		
			ТекстУсловия = "ГДЕ &ФизЛицоНаименование <> """"
			|		И СпрФизЛица.Наименование = &ФизЛицоНаименование"; 
			
			Запрос.УстановитьПараметр("ФизЛицоНаименование", ЗагружаемыеЗначенияСтрока.ФизЛицо_ФИО);
		
		Иначе
		
	        ФИОФизЛица = "";
			
			Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.ФизЛицо_Фамилия) Тогда	
				ФИОФизЛица = ФИОФизЛица + ЗагружаемыеЗначенияСтрока.ФизЛицо_Фамилия;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.ФизЛицо_Имя) Тогда	
				ФИОФизЛица = ФИОФизЛица + ЗагружаемыеЗначенияСтрока.ФизЛицо_Имя;			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.ФизЛицо_Отчество) Тогда	
				ФИОФизЛица = ФИОФизЛица + ЗагружаемыеЗначенияСтрока.ФизЛицо_Отчество;		
			КонецЕсли;
			
			Если ФИОФизЛица <> "" Тогда 
				
				ФИОФизЛица = "%" + ФИОФизЛица + "%";
				
				ТекстУсловия = "ГДЕ &ФизЛицоНаименование <> """"
				|		И СпрФизЛица.Наименование ПОДОБНО &ФизЛицоНаименование";
				
				Запрос.УстановитьПараметр("ФизЛицоНаименование", ФИОФизЛица);
			КонецЕсли;  
			
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ТекстУсловия; 
		
		Запрос.УстановитьПараметр("УсловиеПоФизЛицу", ТекстУсловия);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.РегистрацияПрочихВыплат;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция ТекстОтраженияВРеглУчете() Экспорт

	Если НЕ ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетПрочихВыплатУП");
		Возврат Модуль.РегистрацияПрочихВыплатТекстЗапросаВТОтраженияВРеглУчете();
	КонецЕсли;
	
КонецФункции	

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламентированном учете.
//
// Возвращаемое значение:
//   Строка - текст построения временной таблицы для отражения в регл. учете.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	Возврат "";

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПрочихВыплат(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) КАК Период
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|	Документ.РегистрацияПрочихВыплат КАК ДанныеДокумента
			|ГДЕ
			|	ДанныеДокумента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СУММА(ДанныеПрочиеВыплаты.СуммаНачисления) КАК СуммаВзаиморасчетов
			|ПОМЕСТИТЬ ВТ_ДанныеПрочиеВыплаты
			|ИЗ
			|	Документ.РегистрацияПрочихВыплат.ПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|ГДЕ
			|	ДанныеПрочиеВыплаты.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДокумента.Период КАК Период,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	ДанныеПрочиеВыплаты.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|	ЕСТЬNULL(ИсторияРегистрацийВНалоговомОрганеПодразделения.РегистрацияВНалоговомОргане, ИсторияРегистрацийВНалоговомОрганеОрганизация.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
			|ИЗ
			|	ВТ_ДанныеПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ДанныеДокумента
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеОрганизация
			|		ПО (ДанныеДокумента.Организация = ИсторияРегистрацийВНалоговомОрганеОрганизация.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаОкончания)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеПодразделения
			|		ПО (ДанныеДокумента.Подразделение = ИсторияРегистрацийВНалоговомОрганеПодразделения.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаОкончания)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
